let articleheader=[
    {
        id:1,
        title_article_header:'معرفی بهترین سایت آموزش جاوا اسکریپت [ تجربه محور ] + آموزش رایگان',
        img_article_header:'https://dan-it.com.ua/wp-content/uploads/2019/01/javascript.png',
        p1_article_header:'جاوا اسکریپت یکی از زبان‌های برنامه‌نویسی اصلی حوزه فرانت‌اند است که به واسطه فریم ورک‌های آن می‌توان انواع وب سایت‌ها، اپلیکیشن‌ها و وب اپلیکیشن‌ها را طراحی کرد. به طور کلی بعد از یادگیری html و css معمولاً باید آموزش جاوا اسکریپت را نیز فرا بگیرید. . چرا که این زبان تکمیل‌کننده html و css بوده و در چنین شرایطی موقعیت‌های شغلی بیشتر را در اختیار خواهید داشت و همچنین می‌توانید پروژه‌های گسترده‌تری را انجام دهید.',
        p2_article_header:'در حال حاضر با وجود منابع رایگان موجود در وب شما به راحتی می‌توانید زبان جاوا اسکریپت را به صورت حرفه‌ای فرا بگیرید. به همین واسطه در ادامه مطلب قصد داریم سایت‌های شاخص آموزش این زبان برنامه‌نویسی در جهان را به شما معرفی کنیم و در آخر بگوییم که بهترین سایت آموزش جاوا اسکریپت کدام است.',
   
 
    },
    {
        id:2,
        title_article_header:'بررسی تفاوت ui و UI | ux بهتر است یا UX ؟',
        img_article_header:'https://almaatech.ir/wp-content/uploads/2021/01/UXUI.png',
        p1_article_header:'همه کاربران فضای مجازی هنگام کار کردن با نرم‌افزار‌های مختلف با موارد متنوعی روبه‌رو می‌شوند که همه آن‌ها سیستم‌های ظاهر زیبایی دارند اما در باطن کار کردن با آن‌ها بسیار مشکل است و یا بالعکس. در این مقاله ما سعی داریم که دو مفهوم ui و ux را از نظر تفاوت‌هایی که با یکدیگر دارند مورد بحث و بررسی قرار دهیم. بنابراین در آخر این مقاله شما با تفاوت ui و ux و اینکه آیا UI بهتر است یا UX ؟ بیشتر آشنا خواهید شد.',
        p2_article_header:'احتمالا شما نیز جزو آن دسته از افرادی هستید که روزانه با یکی از عبارت‌های ui و ux سر و کار دارید ولی هنوز نتوانسته‌اید به‌طور دقیق تفاوت ui و ux را کامل متوجه شوید. ما در این مقاله سعی کردیم شما را با این دو مفهوم بیشتر آشنا کنیم.'
    },
]


export default articleheader