

let productpagedata=[
   


    {
        id:1,
        img_header:'img/django.png',
    
        text_header1:'از ویژگی های مهم این دوره میتونیم به توضیح کامل مفاهیم پایه و ساختاری، کامل بودن و توجه به جزئیات، بررسی روش های مختلف حل مسئله و انتخاب بهترین روش ممکن، رعایت اصول کدنویسی، توجه به داکیومنت خوانی، بررسی خطاهای احتمالی و پشتیبانی اختصاصی اشاره کرد. ',
        text_header2:'جنگو یک فریمورک وب مبتنی بر پایتون  و زبان سطح بالا میباشد که امکان طراحی سایت فروشگاهی و توسعه سریع وب سایت‌های ایمن را فراهم می‌کند. جنگو توسط توسعه دهندگان باتجربه ساخته شده و از بسیاری از مشکلات هنگام تولید وب سایت پیشگیری می‌کند',
        text_header3:'بنابراین می‌توانید بدون نیاز به هیچ نگرانی خاصی، تنها روی نوشتن برنامه خود و یا ساخت و طراحی سایت شرکتی خود تمرکز کنید.'  
       
    },
    {
        
        id:2,
        img_header:'img/payton.png',
   
        text_header1:'حیف نیست محبوب ترین زبان برنامه نویسی دنیا رو  ناقص و بی هدف یادبگیری؟ ما تصمیم داریم دوره رایگان پایتون رو به نحوی آموزش بدیم که کامل ترین دوره آموزشی، هم در مقایسه با دوره های خارجی و هم در مقایسه با دوره های داخلی باشه و همه ی تجربه های تلخت رو از یادگیری برنامه نویسی بشوره ببره! ',
        text_header2:'این آموزش از زیر صفر و پایه ترین مبحث شروع میشه تا تخصصی ترین و پیشرفته ترین مباحث، هر قسمت کلی پروژه و تمرین حل می کنیم، برات تکلیف مشخص می کنیم، کاربردشو تو دنیای واقعی نشون میدیم و در آخر…؛',
        text_header3:'این یعنی یک دوره صفر تا نزدیکای صد پایتون! این دوره کاملا رایگان برای شما ارائه میشه! در ادامه به طور کامل راجع به آموزش (Python)   توضیحات کامل می­دهیم.'  
       
    },
    {
      
        id:3,
        img_header:"img/css.jpg",
  
        text_header1:'توی دوره مقدماتی تا پیشرفته Css یاد میگیری چطوری به المانای خشک و بی جون HTML زیبایی ببخشی. اینجا ما از رنگی کردن متن و دکمه ها میگیم تا پیاده سازی یه لندینگ پیج خفن و دلنشین با css. کاملا رایگان!',
        text_header2:'تا اینجای کار با HTML آشنا شدی و میتونی اسکلت یه سایتو پیاده کنی دمت گرم. یه قدم بزرگ برداشتی.بهت تضمین میدم محتوای این دوره به حدی شیرینه که بعد از این دوره استایل اطرافیانتو به صورت کد css میبینی',
        text_header3:'نکته: اگه HTML رو هنوز یاد نگرفتی برگرد کامل یادش بگیر چون لازمه css اینه که با html آشنا باشی.'
       
    },
    {
        
        id:4,
        img_header:"img/html.jpg",
 
        text_header1:'اولین قدم شروع طراحی وبسایت، آموزش HTML هست. HTML یه زبان نشانه گذاری هست که با کمک اون میتونی تگ هایی بنویسی تا سایت رو روی اون تگ ها پیاده کنی.',
        text_header2:'همونجوری که هیچ موجودی نمیتونه بدون اسکلت زندگی کنه، هیچ وبسایتی هم نمیتونه بدون HTML لود بشه. با یادگیری HTML خیلی راحت و قشنگ میتونی یه اسکلت سفت و سخت برای وبسایتت درست کنی.',
        text_header3:'نگران یادگیریشم نباش. ما تو این سایت به صورت کاملا رایگان یه دوره مقدماتی تا پیشرفته HTML تدارک دیدیم، تا بدون دغدغه مسیر طراحی سایت رو شروع کنی.این آموزش به صورت کاملا عملی و پروژه محور هست، طوری که بعد از چند جلسه به راحتی میتونی یه فرم ثبت نام با کمک HTML طراحی کنی.'  
       
    },
]

export default productpagedata