let textdata=[
    

    {
     id:1,
     items:[
        { 
     text1:'وقتی درخواستی به یک سرور وب می‌رسد، ابتدا این درخواست به جنگو منتقل می‌شود و جنگو سعی می‌کند بفهمد چه چیزی مورد درخواست واقع شده است. همچنین جنگو آدرس صفحه وب را می‌گیرد و سعی می‌کند بفهمد چه کاری باید انجام دهد. این قسمت توسط url resolver Django انجام می‌شود (توجه داشته باشید که آدرس وب سایت URL نامیده می‌شود که مخفف Uniform Resource Locator می‌باشد.) سپس جنگو لیستی از الگوها را می‌گیرد و سعی می‌کند URL را با آنها تطبیق دهد. جنگو الگوها را از بالا به پایین بررسی می‌کند و اگر درخواست با الگوی خاصی مطابقت داشته باشد، جنگو درخواست را به عملکرد مرتبط منتقل می‌کند (که به آن View می‌گویند).',
     text2:'یک حامل نامه را با یک نامه تصور کنید. او در خیابان قدم می‌زند و هر شماره خانه را با شماره موجود در نامه چک می‌کند. اگر مطابقت داشته باشد، نامه را آنجا می‌گذارد. urlresolver نیز همین گونه کار می‌کند!',
     img:'https://sarobartech.com/media/blog/python--django.png',
     title:'جنگو چگونه کار می‌کند؟ ',
    },
    {
     text1:'جنگو تقریباً امکان همه کارهایی را که ممکن است توسعه دهندگان بخواهند انجام دهند را فراهم می‌کند. از آنجا که هر آنچه شما نیاز دارید بخشی از یک “محصول” است، همه اینها به طور یکپارچه با هم کار می‌کنند و از اصول طراحی سازگار با هم پیروی می‌کنند و مستندات گسترده و به روز دارند. از جنگو می‌توان تقریباً برای ساختن هر نوع وب سایتی (از سیستم‌های مدیریت محتوا، طراحی پورتال و ویکی‌ها گرفته تا شبکه‌های اجتماعی و سایت‌های خبری و طراحی سایت ریسپانسیو) استفاده کرد. این برنامه می‌تواند با هر فریمورک سمت مشتری دیگری نظیر فریم ورک های php نیز کار کند و می‌تواند تقریباً در هر قالب (از جمله HTML، RSS، JSON، XML، PHP و غیره) محتوایی را ارائه دهد. جهت اطلاع از اینکه php چیست کلیک نمایید.  ',
     text2:'جنگو با ارائه یک فریمورک قدرتمند جهت محافظت خودکار از وب سایت طراحی شده است و به توسعه دهندگان کمک می‌کند تا از بسیاری از اشتباهات معمول امنیتی جلوگیری کنند. به عنوان مثال، جنگو یک روش ایمن برای مدیریت حساب‌های کاربری و رمزهای عبور کاربر، اجتناب از اشتباهات رایج مانند قرار دادن اطلاعات جلسه (Sessions) در کوکی‌ها و در جاهایی که آسیب پذیر میباشد یا ذخیره مستقیم رمزهای عبور به جای هش نمودن آنها و… فراهم می‌کند..',
     img:'https://files.virgool.io/upload/users/107925/posts/ti2ard68im5o/wcw9ety9msp7.png',
     title:'برخی مزایای فریم‌ورک جنگو',
    },
    {
        
     text1:'برای استفاده از فریم ورک جنگو به آشنایی با زبان پایتون و توابع آن نیاز دارید. همچنین آشنایی با مواردی مانند ساختار ذخیره داده‌ها در پایتون مانند Tuple، List و غیره ,مفاهیم برنامه نویسی شی گرا ,JSON و REST APIs, مدیریت پایگاه داده و دستورات SQL.',
     text2:'چیدمان پیکسل‌ها در این صفحه‌نمایش به‌صورت الماسی یا همان diamond PenTile است. این حالت قرارگیری کاملا برخلاف صفحات نسل‌های قبلی آیفون است که در آن‌ها شاهد حضور ریزپیکسل‌های اختصاصی RGB بودیم. خیلی‌ها این چیدمان پیکسلی را دوست ندارند اما در نظر داشته باشید که اپل ادعا می‌کند با استفاده از تکنیک‌های خاص و با استفاده از رندرهای ریزپیکسل‌ها تلاش کرده تا این چیدمان پنتایل بسیار واقعی‌تر از چیدمان پنتایلی باشد که در صفحات سامسونگ می‌بینید.',
     img:'https://res.cloudinary.com/practicaldev/image/fetch/s--iEmy2OHM--/c_imagga_scale,f_auto,fl_progressive,h_900,q_auto,w_1600/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/4bv6tjo2s9zq7oycou2x.jpeg',
     title:'پیش نیازهای لازم برای یادگیری جنگو چیست؟ ',
    },
    {
     text1:'در این مطلب بررسی کردیم که جنگو چیست و چه ویزگی هایی دارد. اگر قصد ورود به دنیای طراحی وب و اپلیکیشن را دارید، جنگو می‌تواند گزینه مناسبی برای یادگیری باشد. یادگیری پایتون می‌تواند قدرت استفاده از جنگو را در اختیار شما گذاشته و بازار کار جدیدی برایتان فراهم کند. جنگو به سرعت کارها را پیش می‌برد و شما را قانع می‌کند که چرا به جای آن، سراغ یادگیری فریم ورک دیگری نرفته اید. ما آماده است به شما در یادگیری پایتون و فریم ورک‌های آن کمک کند و همراه شما در این مسیر هیجان انگیز باشد. ',
     text2:'  ',
     img:'https://faradars.org/wp-content/uploads/2018/01/fvpht9611-png.png',
     title:'جمع بندی',
    }
     ]
   

    

    
    },

    {
        id:2,
       items:[
        {
 title:'با آموزش پایتون  به آچار فرانسه تبدیل شو!',
        text1:'الان و امروز تو جامعه برنامه نویسی میبینیم که همه دارن درمورد پایتون صحبت می‌کنن و دلیل خوبی هم برای این کار دارن. پایتون با یه جامعه به‌طور تصاعدی در حال رشد، پیرامون علم داده، یادگیری ماشین، هوش مصنوعی، توسعه‌دهندگان وب و …، به زبانی تبدیل شده که دسترسی برنامه‌نویسان رو به جهان باز می‌کنه! دوره پایتون برای پیشرفت شما تولید و به صورت رایگان منتشر شده.',
        text2:'شایعاتی که شنیدید درسته! پایتون از نام گروه کمدی بریتانیایی برداشته شده. ون روسوم، به دنبال اسمی کوتاه، ساده و کمی مرموز بود و در حال خواندن اسکریپت‌های یک سیرک، اسم پایتون رو برای شاهکار خودش انتخاب کرد. جالبه بدونید توی قلمرو برنامه‌نویسی، زبان برنامه‌نویسی پایتون بر پایه خوندن، نوشتن و یادگیری آسون طراحی شده و از اون‌جایی کاملا منعطف هست',
img:'https://sctae.jdsharif.ac.ir/wp-content/uploads/2022/04/python.jpg',
        },
        {

title:'چرا پایتون زبان محبوبی است؟',
text1:'زیرا پایتون زبانی با نحو ساده، ساختار شفاف، متن‌باز، رایگان، دارای کتابخانه‌های متعدد، همه‌منظوره و با پشتیبانی از پارادایم‌های برنامه‌نویسی گوناگون است. در این بخش از مطلب یادگیری پایتون چقدر زمان میبرد به دلایل محبوبیت این زبان برنامه‌نویسی پایتون پرداخته شده است. دلایل گوناگونی برای محبوبیت بالای پایتون و افزایش روزافزون این محبوبیت وجود دارد. ',
text2:'برخی از این دلایل نشات گرفته از همان چهار هدف اصلی هستند که روسوم برای پایتون بیان کرده و حقیقتا تامین شده‌اند.شرکت‌های بزرگ و مهم فناوری در جهان مانند گوگل، فیس‌بوک، ناسا، یاهو، دراپ‌باکس، موزیلا، کورا، اینستاگرام، ردیت، آی‌بی‌ام و بسیاری از دیگر موارد، از هواداران پایتون محسوب می‌شوند که از این زبان در پروژه‌های نرم‌افزاری گوناگون خود استفاده می‌کنند.',
img:'https://files.virgool.io/upload/users/12142/posts/gltk4eh7oms7/ba8muy2k2cks.jpeg',
        },
        {

title:'بازار کار پایتون و درآمد برنامه‌نویس پایتون در ایران و جهان',
text1:'مسئله‌ای که برای بسیاری از افراد ضمن یادگیری یک مهارت مطرح می‌شود این است که بازار کار آن مهارت و درآمد کارشناسان آن چه میزان است. در زمینه یادگیری برنامه‌نویسی و زبان پایتون نیز این موضوع صدق می‌کند. در این بخش از مطلب یادگیری پایتون چقدر زمان میبرد به این موضوع پرداخته شده است.',
text2:'بسیاری از افراد از ابتدا به این دلیل جذب دنیای برنامه‌نویسی می‌شوند که نه تنها در حال حاضر بازار کار خوبی دارد، بلکه از چشم‌انداز و آینده شغلی خوبی نیز بهره‌مند است و برنامه‌نویس‌ها معمولا از جایگاه و درآمد شغلی خوبی برخوردار هستند. پایتون نیز از این قاعده مستثنی نیست. پایتون یکی از زبان‌های برنامه‌نویسی است که فرصت‌های شغلی متعدد و متنوعی برای آن موجود است و برنامه‌نویسان این حوزه، درآمد و جایگاه شغلی خوبی دارند.',
img:'https://files.virgool.io/upload/users/19654/posts/xqitwpl9ny7i/sxwfhivaxm7h.jpeg',
        },
        {
     
title:'برای شروع این دوره چه پیش نیاز هایی را باید بلد باشیم؟',
text1:'آشنایی با اصول و مبانی برنامه‌نویسی لازمه و پیش‌نیاز یادگیری هر زبان برنامه‌نویسی است. چه فرد قصد یادگیری پایتون را داشته باشد و چه بخواهد هر زبان دیگری را یاد بگیرد، باید اصول و مبانی برنامه‌نویسی را بداند. از جمله اصول و مبانی برنامه‌نویسی می‌توان به موارد زیر اشاره کرد:مفهوم نرم‌افزار,تاریخچه تکاملی زبان‌های برنامه‌نویسی,انواع زبان‌های برنامه‌نویسی,آشنایی با انواع دستورها و بخش‌های سازنده یک برنامه.',
text2:'در کل مهم نیست که اکنون شما کجا هستید و در چه وضعیتی . پایتون را بلدید یا نه . مهم این است که این نکات بالا را باید بدانید .برای یادگیری پایتون عجله کنید این زبانی است که همه جا کاربرد دارد و گسترده است اگر رفتید لینوکس به درد میخوره اگر ویندوزی بودید باز به درد میخوره اگر مک هستید بازم میتونید باهاش کار کنید اگر وب سایت یا فروشگاه آنلاین میخواهید بسازید پایتون کمکتون میکنه',
img:'https://iehouse.org/wp-content/uploads/2019/05/python.jpg'
        }
       ]
  
       },


       {
        id:3,
        items:[
            {
 title:'چه نکاتی در دوره آموزش جامع CSS می آموزیم؟',
        text1:'شما در دوره Css مقدماتی با خیلی از Property ها و نکات Css آشنا شدید و بعد از دوره Css مقدماتی می توانستید سایت های مختلفی طراحی کنید.اما در Css مطالب پیشرفته ای نیز وجود داره که برای تسلط در Css باید آن ها را بلد باشید.',
        text2:'مثلا شما بعد از دوره Css مقدماتی سبزلرن نمی توانستید به قسمت های مختلف سایت انیمیشن اعمال کنید یا …در این دوره موارد پیشرفته Css به صورت پروژه محور به شما آموزش داده می شود و در انتهای دوره چندین مینی پروژه نیز انجام شده تا شما مطالب لازم را به طول کامل و عمیق یاد بگیرید و به راحتی بتوانید سایت های مختلفی طراحی کنید. ​',
        img:'https://uploads-ssl.webflow.com/60d29cc33f302e8be91cf0e2/60e82825f9d9a8248dc6d7c1_5ec7b9f386cd2e35473558d8_CSS%2520logo.jpeg',
            },
            {

        title:'برای شروع این دوره چه پیش نیاز هایی را باید بلد باشیم؟',
        text1:'برای ساخت یک وب سایت قبل از هر چیزی از زبان Html برای ساخت ساختمان کلی و اسکلت بندی آن استفاده میشه و بعد از پیاده سازی این مورد، نوبت به Css میرسه که سایت رو باهاش خوشگل بکنیم و به اسکلت ساخته شده استایل و رنگ و لعاب مورد نظرمون رو اعمال بکنیم.',
        text2:'پس برای شروع یادگیری زبان Css کافیه که زبان Html رو به خوبی بلد باشین و به جز Html هیچ پیش نیاز دیگه ای نیاز نیست.',
        img:'https://blog.logrocket.com/wp-content/uploads/2022/03/deep-dive-css-where-function-nocdn.png',
            },
            {

        title:'آیا یادگیری Css سخت است؟',
        text1:'یادگیری مفاهیم و مطالب زبان Css کار پیچیده و دشواری نیست و می توانید آن ها را به خوبی یاد بگیرین. اما فقط دونستن این مطالب کفایت نمیکنه. بلکه باید بتونین از Css در پروژه های واقعی استفاده کنین و باهاش طرح های خوشگل و جذاب پیاده سازی کنین.',
        text2:'این موضوع نیازمند تمرین و تکرار هست و یه کوچولو زمان میگیره ازتون که باید حوصله به خرج بدین و دست از تمرین و تکرار برندارین و همچنین باید کمی خلاقیت هم داشته باشین.',
        img:'https://www.hamyarit.com/wp-content/uploads/2020/04/css-art.png-hamyarit.com-css-art.png',
            },
            {
   title:'آیا دوره آموزش Css پروژه محور است؟',
        text1:'جواب این سوال مثبت است.حوزه برنامه نویسی به شکلی است که اگر فقط خود مطالب رو یاد بگیرین درحالی که هیچ پروژه‌ای با آن ها پیاده سازی نکنین، به هیچ وجه نمیتونین اونطور که باید به سطح تسلط برسین.',
        text2:'به همین دلیل در دوره آموزش Css چندین پروژه جذاب و خفن براتون پیاده سازی کردیم تا بتونین با مشاهده آن ها و تمرین و تکرار به سطح خیلی خوبی در Css برسید و این زبان قدرتمند رو به خوبی یاد بگیرین.',
        img:'https://ksra.eu/wp-content/uploads/2021/05/Vp9WvV7YKdH4k8sKRePcE8-1200-80.jpeg'
            }
        ]
       
     


       },



       {
        id:4,
        items:[
            {

        title:'چه نکاتی در این دوره می آموزیم؟',
        text1:'شما در دوره Html مقدماتی با خیلی از تگ ها و نکات Htmlمثل تگ های مربوط به متون، چیدمان عناصر و … آشنا شدید و بعد از دوره Html مقدماتی می توانستید سایت های مختلفی را در حد اسکلت بندی طراحی کنید. مثلا شما بعد از دوره Html مقدماتی سبزلرن نمی توانستید عناصری مثل موزیک، ویدئو و … را در سایت درج کنید.',
        text2:'در این دوره موارد پیشرفته Html به شما آموزش داده می شود و چندین مینی پروژه نیز در دوره انجام شده تا شما مطالب لازم را به طول کامل و عمیق یاد بگیرید و به راحتی بتوانید هر عنصری که خواستید در سایت های خودتون درج کنید.',
        img:'https://darsman.com/Images/UploadCKEdior/reasons-use-html.webp',
            },
            {

        title:'در چه مدت زمانی می توان Html را یاد گرفت؟',
        text1:'مدت زمان یادگیری Html برای هر شخص متفاوت بوده و به پارامتر های مختلفی بستگی دارد. پارامتر هایی مثل سطح علاقه شخص، سطح چالش پذیر بودن، سطح تسلط در زبان انگلیسی، تسلط شخص در سرچ کردن و … و نمی توان یک مدت زمان ثابتی را برای هر شخص در نظر گرفت. ممکن است شخصی در یک ماه بتواند Html را یاد بگیرد اما شخصی دیگر در 2 ماه هم نتواند به سطح لازم برسد.',
        text2:'پس مدت زمان یادگیری یک مقوله ای است که به خود شما بستگی دارد اما اگر بخواهیم یک مدت زمان میانگین در نظر بگیریم، می توان Html را در 1 ماه یاد گرفت.',
        img:'https://www.hamyarit.com/wp-content/uploads/2016/02/html.png-hamyarit.com-html.png',
            },
            {

        title:'بازار کار طراحی وب در چه وضعیتی قرار دارد؟',
        text1:'همان طور که می دانید امروزه تقریبا تمام کسب و کار ها به سمت آنلاین شدن حرکت کرده اند و هر کسب و کار آنلاین و اینترنتی قطعا به یک وب سایت نیاز دارد. برای بررسی بازار کار و میزان درآمد برنامه نویسی وب بهتر است به منابعی مراجعه کنیم که در زمینه بازار کار و استخدام فعالیت می کنند؛ مثل جابینجا، جاب ویژن، آی استخدام و … .',
        text2:'به عنوان مثال آگهی های زیر از وب سایت جابینجا می باشند:',
        img:'https://sariasan.com/wp-content/uploads/2022/05/word-image-263.jpeg',
            },
            {

        title:'برای شروع این دوره چه پیش نیاز هایی را باید بلد باشیم؟',
        text1:'زبان Html اولین قدم برای ورود به حوزه توسعه وب می باشد که تقریبا هیچ پیش نیازی ندارد. همین که شما به این حوزه علاقمند باشید و یک سیستم (کامپیوتر و لپتاپ) داشته باشید می توانید دوره آموزش Html را شروع کرده و یاد بگیرید. اما مورد بعدی این است که هر حوزه شغلی اصطلاحات و مفاهیم خاص خودش را دارد که توسط فعالان آن حوزه مورد استفاده قرار می گیرد. اگر شما قبل از ورود به یک حوزه شغلی با اصطلاحات و مفاهیم تخصصی آن آشنایی داشته باشید، می توانید مسیر یادگیری بهتر، هموار تر و سریع تری را داشته باشید.',
        text2:'به عنوان مثال حوزه آشپزی ادویه ها و ظروفی وجود دارد که قطعا افراد عادی با آن ها آشنایی ندارند. و حتی اسامی آن ها را نمی دانند. حوزه برنامه نویسی وب نیز اصطلاحات و مفاهیم خاصی مثل هاست، دامنه، فرانت اند، بک اند، سرور، دیتاسنتر، دپلود کردن و … وجود دارد که اگر قبل از یادگیری Html آن ها را یاد بگیرید، می توانید یادگیری Html را خیلی سریع تر و بهتر پیش ببرید.',
        img:'http://www.startertutorials.com/ajwt/wp-content/uploads/2014/01/html1-2bk3qb4.jpg'
            },


        ]


       },


    ]

export default textdata






