import React from 'react'
import Maghaleheader from './Maghaleheader'
import { useState } from 'react';
import Maghaletext from './Maghaletext'
import Article from '../Main/Article/Article'
import './maghale.css'
export default function Maghale() {
  const [maghaleheader,setmaghaleheadre]=useState({
    title_maghale_header:'معرفی بهترین سایت آموزش جاوا اسکریپت [ تجربه محور ] + آموزش رایگان',img_maghale_header:'https://sabzlearn.ir/wp-content/uploads/2022/04/best-site-for-js-shaxes-1.jpg',
    p1_maghale_header:'جاوا اسکریپت یکی از زبان‌های برنامه‌نویسی اصلی حوزه فرانت‌اند است که به واسطه فریم ورک‌های آن می‌توان انواع وب سایت‌ها، اپلیکیشن‌ها و وب اپلیکیشن‌ها را طراحی کرد. به طور کلی بعد از یادگیری html و css معمولاً باید آموزش جاوا اسکریپت را نیز فرا بگیرید. . چرا که این زبان تکمیل‌کننده html و css بوده و در چنین شرایطی موقعیت‌های شغلی بیشتر را در اختیار خواهید داشت و همچنین می‌توانید پروژه‌های گسترده‌تری را انجام دهید.',
    p2_maghale_header:'در حال حاضر با وجود منابع رایگان موجود در وب شما به راحتی می‌توانید زبان جاوا اسکریپت را به صورت حرفه‌ای فرا بگیرید. به همین واسطه در ادامه مطلب قصد داریم سایت‌های شاخص آموزش این زبان برنامه‌نویسی در جهان را به شما معرفی کنیم و در آخر بگوییم که بهترین سایت آموزش جاوا اسکریپت کدام است.'
})

const [maghaletext,setmaghaletext]=useState([ 
    { title_maghale_text:'Codecademy', p_maghale_text:'یکی از سایت‌های معروف و محبوب دنیا که در زمینه آموزش انواع زبان‌های برنامه‌نویسی از قبیل جاوا اسکریپت فعالیت دارد، کد آکادمی است. این سایت منابع بسیار زیادی را در اختیار کاربران قرار می‌دهد و شما می‌توانید با استفاده از آن‌ها زبان برنامه‌نویسی جاوا اسکریپت را به صورت حرفه‌ای فرا بگیرید. برای استفاده از منابع موجود در سایت کد آکادمی باید ابتدا یک اکانت در آن ایجاد کنید. ساخت اکانت در وب سایت رایگان است. برنامه زبان جاوا اسکریپت موجود در سایت به صورت واضح و روان آماده‌سازی شده‌اند تا شما بتوانید به بهترین شکل با مفاهیم و مباحث این زبان برنامه‌نویسی آشنا شوید. همچنین محتوای آموزشی موجود در سایت را بر اساس هر تغییر به روز‌رسانی می‌شوند و شما به جدیدترین مطالب در خصوص این زبان برنامه‌نویسی دسترسی خواهید داشت. سایت کد آکادمی در دسته بهترین سایت آموزش جاوا اسکریپت قرار می‌گیرد.'},
    { title_maghale_text:'HTML Dog ', p_maghale_text:'یکی دیگر از وبسایت‌های شاخص و رایگان فعال در زمینه آموزش جاوا اسکریپت HTML Dog است. منابع آموزشی مربوط به این زبان برنامه‌نویسی را در اختیار کاربر قرار می‌دهد. مطالب موجود در این وب سایت در سه سطح مبتدی، متوسط و پیشرفته دسته‌بندی شده‌اند. در نتیجه می‌توانید بر اساس شرایط خود، سطح مورد نظر را تعیین کرده و فرآیند یادگیری زبان جاوا اسکریپت را شروع کنید.'},
    { title_maghale_text:'javaScript.info ', p_maghale_text:' این سایت در سراسر دنیا طرفداران نسبتاً زیادی دارد و به عنوان یکی از گزینه‌های اصلی بهترین سایت آموزش جاوا اسکریپت شناخته می‌شود. این وب سایت دوره آموزشی جامع و رایگانی را در اختیار کاربران قرار می‌دهد تا افراد بتوانند به صورت رایگان و با تکیه بر تلاش و استعمار خود زبان جاوا اسکریپت را به طور کامل فرا بگیرند. دو نوع محتوا در این وب سایت وجود دارد؛ دسته‌ای از محتوا‌های آموزشی مربوط به کد‌نویسی با زبان جاوا اسکریپت بوده و دسته دیگر مربوط به اجرای انواع دستورات این زبان برنامه‌نویسی و طبقه‌بندی اطلاعات مورد نظر است. شما می‌توانید با توجه به خود محتوا را برای یادگیری این زبان انتخاب کنید. به طور کلی وب سایت javaScript. info یکی از بهترین مراجع آموزش آنلاین زبان برنامه‌نویسی برای افراد آماتور در برنامه‌نویسی است.'},
    { title_maghale_text:'Learn JS ', p_maghale_text:'به واسطه سایت Learn JS برای یادگیری زبان برنامه‌نویسی جاوا اسکریپت از هر سایت دیگری بی‌نیاز خواهید شد. فرقی نمی‌کند که شما با مفاهیم و ساختار این زبان برنامه‌نویسی آشنا هستید یا خیر؛ فقط کافی است تا بر اساس شرایط خود دوره‌های آموزشی و منابع موجود در سایت را مشاهده کرده و با استفاده از آن‌ها دانش و مهارت خود را در جاوا اسکریپت تقویت کنید. منابع موجود در این سایت اغلب رایگان هستند و شما می‌توانید تنها با داشتن دانش زبان انگلیسی به صورت رایگان این زبان برنامه‌نویسی را یاد بگیرید.'},
    { title_maghale_text:'W3schools ', p_maghale_text:'اکثر دوره‌های برنامه‌نویسی که به زبان فارسی تهیه می‌شوند، بر اساس منابع موجود در وب سایت W3schools هستند. منابع موجود در این وب سایت بسیار معتبر بوده و بر اساس آخرین تغییرات در این زبان برنامه‌نویسی آپدیت می‌شوند. جالب است بدانید که این وبسایت نیز بیشتر برای افراد مبتدی و تازه کار طراحی شده است تا با استفاده از آن بتوانند در مدت زمان کوتاهی با مفاهیم پایه و اولیه برنامه‌نویسی با زبان‌های مختلف از قبیل جاوا اسکریپت آشنایی کافی پیدا کنند. یکی از نکات مثبت این وبسایت آموزشی این است که در طی فرایند آموزش مثال‌های متعددی در ارتباط با هر مفهوم و سرفصل مطرح می‌شود و به همین دلیل شما می‌توانید راحت‌تر مباحث مختلف را درک کنید.'},
    { title_maghale_text:'Guru99  ', p_maghale_text:'سایت Guru99 مدتی است که شما می‌توانید با استفاده از مطالب آموزشی موجود در سایت تنها در ۵ روز مفاهیم مهم و اصلی زبان جاوا اسکریپت را فرا بگیرید. اگرچه یادگیری از زبان برنامه‌نویسی مستلزم تلاش و زمان مشخصی است و می‌توانیم برای هر فرد یک بازه زمانی خاصی را در نظر بگیریم؛ اما با توجه به محتوا‌های خلاصه و اجمالی موجود در سایت برای هر یک از سرفصل‌های این زبان برنامه‌نویسی، یادگیری کلی و نسبی جاوا اسکریپت در طی ۵ روز دور از انتظار نیست. اما باید دقت داشته باشید برای ارتقای سطح دانش خود قطعاً باید از دوره‌های آموزشی دیگر نیز استفاده کنید و این محتوای آموزشی صرفاً برای آشنایی کلی و ابتدایی زبان جاوا اسکریپت آماده‌سازی شده‌اند.'},
    { title_maghale_text:'جمع بندی  ', p_maghale_text:'تا اینجا گزینه‌های مختلفی برای بهترین سایت آموزش جاوا اسکریپت را به شما معرفی کرده و نقاط مثبت و منفی هر یک از مراجع آموزشی را ذکر کردیم. باید توجه داشته باشید در صورتی که دانش و تسلط شما به زبان انگلیسی متوسط رو به بالا است و با اصطلاحات رایج برنامه‌نویسی آشنایی دارید، می‌توانید از منابع موجود در وب سایت‌های معرفی شده نهایت استفاده را ببرید و زبان جاوا اسکریپت را یاد بگیرید.'},
  ]
 )

 const [article,setarticle]=useState([
  {link_article:'/javaarticle',title_article:'معرفی بهترین سایت آموزش جاوا اسکریپت',info_article:'جاوا اسکریپت یکی از زبان‌های برنامه‌نویسی اصلی حوزه فرانت‌اند است که به واسطه فریم ورک‌های...',img_article:'https://sabzlearn.ir/wp-content/uploads/2022/04/best-site-for-js-shaxes-1-400x400.jpg' },
  {link_article:'/Uiuxaricle',title_article:'بررسی تفاوت ui و UI | ux بهتر است یا UX ؟',info_article:'همه کاربران فضای مجازی هنگام کار کردن با نرم‌افزار‌های مختلف با موارد متنوعی روبه‌رو ...',img_article:'https://utec.ut.ac.ir/documents/10125/0/UIUX.png?t=1639812832215' },


]
)
  return (
    <div>
        <Maghaleheader { ...maghaleheader}/>

        <Maghaletext {...maghaletext[0]} /> <hr className='my-3'/>
        <Maghaletext {...maghaletext[1]} /> 
        <div className='img-maghale-text-div mt-5'  data-aos="fade-up">  
          <img src="https://sabzlearn.ir/wp-content/uploads/2021/08/546456.jpeg" className='img-maghale-header ' alt="" />
      </div>
        <Maghaletext {...maghaletext[2]} /><hr className='my-3'/>
      <Maghaletext {...maghaletext[3]} />
      <div className='img-maghale-text-div mt-5' data-aos="fade-up">  
          <img src="https://cdn.educba.com/academy/wp-content/uploads/2018/09/Top-Uses-Of-JavaScript.jpg" className='img-maghale-header img-java-maghale' alt="" />
      </div>
      <Maghaletext {...maghaletext[4]} /><hr className='my-5'/>
      <Maghaletext {...maghaletext[6]} /><hr className='my-5'/>

<div className="footer-maghale-text" data-aos="fade-up">
  <p>مطالب زیر را حتما مطالعه کنید</p>
</div>
<div className="artcli-maghale"  data-aos="fade-up">
  <Article {...article[0]}/>
<Article {...article[1]}/>
</div>




    </div>
  )
}
