import React from 'react'
import Maghaleheader from './Maghaleheader'
import { useState } from 'react';
import Maghaletext from './Maghaletext'
import Article from '../Main/Article/Article'
function Uiuxaricle() {

    const [maghaleheader,setmaghaleheadre]=useState({
        title_maghale_header:'بررسی تفاوت ui و UI | ux بهتر است یا UX ؟',img_maghale_header:'https://sabzlearn.ir/wp-content/uploads/2022/03/ui-ux-shaxes.jpg',
        p1_maghale_header:'همه کاربران فضای مجازی هنگام کار کردن با نرم‌افزار‌های مختلف با موارد متنوعی روبه‌رو می‌شوند که همه آن‌ها سیستم‌های ظاهر زیبایی دارند اما در باطن کار کردن با آن‌ها بسیار مشکل است و یا بالعکس. در این مقاله ما سعی داریم که دو مفهوم ui و ux را از نظر تفاوت‌هایی که با یکدیگر دارند مورد بحث و بررسی قرار دهیم. بنابراین در آخر این مقاله شما با تفاوت ui و ux و اینکه آیا UI بهتر است یا UX ؟ بیشتر آشنا خواهید شد.',
        p2_maghale_header:'احتمالا شما نیز جزو آن دسته از افرادی هستید که روزانه با یکی از عبارت‌های ui و ux سر و کار دارید ولی هنوز نتوانسته‌اید به‌طور دقیق تفاوت ui و ux را کامل متوجه شوید. ما در این مقاله سعی کردیم شما را با این دو مفهوم بیشتر آشنا کنیم.'
    })

    const [maghaletext,setmaghaletext]=useState([ 
      { title_maghale_text:' چیست؟ ‌ui', p_maghale_text:'‌ui مخفف عبارت User Interface است که این کلمه خود به معنای طراحی رابط کاربری می‌باشد. بنابراین ui قسمتی از وب سایت یا اپلیکیشن است که کاربران می‌توانند آن را مشاهده کنند و این طراحی بیشتر جنبه گرافیکی دارد. در وبسایت‌ها و اپلیکیشن‌ها طراحی بخش ui ظاهر همه بخش‌ها را در راستای تکامل جلوه‌های ایده آل هدایت می‌کند. طراحان با استفاده از گرافیست‌های سایت و برنامه‌نویس front end طراحی رابط کاربری را پیاده‌سازی می‌کنند. در خصوص تفاوت UI و UXچیست؟ باید بگوییم که طراحی بخش ui مسئول رسیدگی به چگونگی ظاهر منو، هماهنگی رنگ دکمه جستجو با رنگ اصلی سایت و طراحی مربوط به بنر‌های تبلیغاتی را بر عهده دارد.   اما اگر عمیقاً بخواهیم تفاوت بین ui و ux را مورد بحث و بررسی قرار دهیم و به این سوال کاربران که ui بهتر است یا ux؟ جواب بدهیم باید ابتدا در خصوص وظایف و کاربرد‌های دو مفهوم ui و ux مطالبی بیان کنیم.'},
      { title_maghale_text:' چیست؟ Ux', p_maghale_text:'ux مخفف عبارت User Experience به معنای طراحی تجربه کاری باشد. بنابراین کاربر هنگام کار با اجزای مختلف سایت احساس راحتی می‌کند و بدین ترتیب ux جوانب تعامل کاربر را با هر بخش از سایت تحت کنترل دارد.    همه کاربران باید در خصوص تفاوت ui و ux مطالعه داشته باشند تا بتوانند تشخیص مسئولیت‌ها و وظایف آن‌ها بهترین نوع را انتخاب کنند. اما اگر کاربران بخواهند جواب این سوال که ui بهتر است یا Ux؟ را پیدا کنند باید به سراغ منابع معتبر بروند.  اما مسئله دیگر این است که باید مسائل مربوط به طراحی ux را جهت آشنایی بیشتر با آن بشناسیم تا بتوانیم به تفاوت بین ui و ux پی ببریم. در ux باید طراحی سایت طوری باشد که کاربران بتوانند به راحتی به هر بخش از سایت دسترسی داشته باشند. همچنین برای کار کردن با هر قسمت از سایت باید راحتی کاربر پیش‌بینی شده باشد.'},
      { title_maghale_text:' UI و UX شباهت', p_maghale_text:'شباهت ui و ux این است که هر دوی این دو مفهوم با حرف u شروع می‌شوند اما تفاوت ui و ux چیزی فراتر از این شباهت است. کسی که مسئولیت طراح تجربه کاربری را برعهده دارد، به طور منظم ابتدا برخورد مشتری با محصول و سپس خدمات را برنامه‌ریزی و ساماندهی می‌کند. بدین ترتیب این شخص خود را جای کاربر می‌گذارد و شرایط فرد را مورد بررسی و ارزیابی قرار می‌دهد. این مورد را در نظر می‌گیرد که کاربر پس از ورود به سایت یا اپلیکیشن سراغ کدام گزینه‌ها می‌رود و به کجا هدایت می‌شود.'},
      { title_maghale_text:' ؟ UI یا UX کدام یک ', p_maghale_text:'اگر چه مفهوم ui و ux معنایی متفاوت از یکدیگر دارند، اما در طراحی جدا از هم نیستند. به عبارت دیگر ui و ux دو مکمل هستند و طراحان با استفاده از این دو مفهوم است که طراحی‌های زیبا و کاربردی را به وجود می‌آورند. هر کدام از این دو مفهوم کارایی خاص خود را دارد. به طور مثال ممکن است شما نیز با سایتی مواجه شده باشید که دکمه جستجو در آن طراحی نشده باشد، در این صورت است که شما به ارزش ux در طراحی پی خواهید برد. پس در جواب سوال ” ui بهتر است یا ux؟ با قطعیت نمی‌توانیم یکی از این دو مفهوم را بر دیگری ترجیح داده و مثلاً بگوییم کهui بهتر است. در حالت کلی هر هر دو مفهوم ui و ux مهم و تکمیل‌کننده یکدیگر هستند.'},
      { title_maghale_text:' :UI و UX زمینه های شغلی ', p_maghale_text:'در شرکت‌های نوپا مسئولیت طراح رابط کاربری بر عهده صاحب شرکت می‌باشد. این فرد با استفاده از تکنیک‌های طراحی سایت درخواست‌های خود را برای اعضای گروه می‌فرستد اما در شرکت‌های بزرگ و معتبر فردی را جهت انجام طراحی و بررسی تجربه کاربری استخدام می‌کنند. معمولاً نتیجه‌ای که با طراحی این فرد متخصص به دست می‌آید در مقایسه با طراحی‌های صاحب شرکت بسیار کارآمد‌تر است. در کشور ما مطالعات مرتبط با تفاوت ui و ux نشان داده که مسئولیت طراح تجربه کاری یا همان ux کار را به افرادی که در شغل‌هایی مانند: بازاریابی یا مدیریت شرکت مهارت و توانایی دارند، واگذار می‌شود. بنابراین در بیشتر شرکت‌های ایرانی استخدامui کار به صورت گسترده وجود دارد ولی ux کار به آن صورت استخدام نمی‌شود.'},
    
      { title_maghale_text:'بیشتر اشنا شویم؟ ui و ux چگونه میتوانیم با ', p_maghale_text:'افراد علاقمند به یادگیری می‌توانند از این دوره‌های آموزشی بهره ببرند. در بیشتر این دوره‌ها مبنای کار، آموزش اصولی جهت کسب اطلاعات بیشتر در مورد مفاهیم Ui و Ux است. همچنین اساتید مجرب با استفاده از تکنیک‌های خاص نحوه طراحی رابط کاربری با نرم‌افزار ADOBE XD را آموزش می‌دهند. کاربران بعد از آشنایی با تفاوت ui و ux می‌توانند یکی از این دو مورد را جهت تکمیل پروژه‌های خود مورد استفاده قرار دهند.'},
    ]
   )
  
   const [article,setarticle]=useState([
    {link_article:'/javaarticle',title_article:'معرفی بهترین سایت آموزش جاوا اسکریپت',info_article:'جاوا اسکریپت یکی از زبان‌های برنامه‌نویسی اصلی حوزه فرانت‌اند است که به واسطه فریم ورک‌های...',img_article:'https://sabzlearn.ir/wp-content/uploads/2022/04/best-site-for-js-shaxes-1-400x400.jpg' },
    {link_article:'/Uiuxaricle',title_article:'بررسی تفاوت ui و UI | ux بهتر است یا UX ؟',info_article:'همه کاربران فضای مجازی هنگام کار کردن با نرم‌افزار‌های مختلف با موارد متنوعی روبه‌رو ...',img_article:'https://utec.ut.ac.ir/documents/10125/0/UIUX.png?t=1639812832215' },
  
  
  ]
  )
  return (
    <div>
        <Maghaleheader { ...maghaleheader} />
        

        <Maghaletext {...maghaletext[0]} /> <hr className='my-3'/>
        <Maghaletext {...maghaletext[1]} /> 
        <div className='img-maghale-text-div mt-5' data-aos="fade-up">  
          <img src="https://www.irandnn.ir/mag/wp-content/uploads/2020/07/ui-and-ux.jpeg" className='img-maghale-header img-java-maghale' alt="" />
      </div>
        <Maghaletext {...maghaletext[2]} /><hr className='my-3'/>
      <Maghaletext {...maghaletext[3]} />
      <div className='img-maghale-text-div  mt-5' data-aos="fade-up">  
          <img src="https://www.exposit.com/wp-content/uploads/2021/12/Blog_cover-109-scaled.jpeg" className='img-maghale-header img-java-maghale img-maghale-text-border' alt="" />
      </div>
      <Maghaletext {...maghaletext[4]} /><hr className='my-5'/>
      <Maghaletext {...maghaletext[5]} /><hr className='my-5'/>

<div className="footer-maghale-text" data-aos="fade-up">
  <p>مطالب زیر را حتما مطالعه کنید</p>
</div>
<div className="artcli-maghale"  data-aos="fade-up">
  <Article {...article[0]}/>
<Article {...article[1]}/>
</div>


        </div>
  )
}

export default Uiuxaricle